projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/ЧтениеДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЧтениеДеклараций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыCMR</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Декларация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусТранзита</Name>
							<Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декларант</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаНачалаТранзита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаОбеспечения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОформления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераCMR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоCMR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТаможниОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принципал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КППКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортныеСредства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПунктаОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПунктаНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НеНайденныеПункты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ПрочитанныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрочитанныеДекларации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТранзита</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПрочитаноСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JSONДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПоручительству</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/СтатусыТранзита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыТранзита</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТранзитРазрешен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированоСпециалистом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеЗаключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеЗарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваРазрезервированы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНеВыпущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварВыпущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранзитЗавершенСОговорками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗаключенииДополненияОтказано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеОтправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранзитЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказаноВПриемеДополнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныйДосмотр</Name>
					<Comment>Машина остановлена на досмотр — расчёт срока транзита не применяется, ожидание</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/СтатусыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИдентифицирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетРучнойКорректировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРассчитан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/ЧтениеДеклараций/Ext/ObjectModule.bsl
// Доработка START {Полная переработка модуля по ТЗ «Интеграция Сигма-Софт и 1С:УТ»} {2026-04-01}
// Ключевые изменения:
// - Парсинг email из Comment через решётки #email@example.com#
// - Поиск контрагента по email через РС.КонтактнаяИнформация (стандарт БСП)
// - Обработка флага #1# (чужое обеспечение)
// - Дедупликация включена
// - Очистка ТЧ перед загрузкой
// - Логирование всех ошибок в ЖурналРегистрации
// - Защита от дублей таможенных пунктов

Функция СведенияОВнешнейОбработке() Экспорт

	ПредставлениеКоманды = "Синхронизация СигмаСофт";
	ИдентификаторКоманды = "СинхронизацияСигма";

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	ПараметрыРегистрации.Информация = "Импорт операций из Сигма-Софт";
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "2.0";
	ПараметрыРегистрации.БезопасныйРежим = Истина;

	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = ПредставлениеКоманды;
	Команда.Идентификатор = ИдентификаторКоманды;
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Истина;

	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеКаталогаВременныхФайлов(Истина, Истина, "Для чтения XML-файлов Сигмы");
	ПараметрыРегистрации.Разрешения.Добавить(Разрешение);

	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса("HTTPS", "customs.gov.ru", 443, "Для поиска таможенных пунктов");
	ПараметрыРегистрации.Разрешения.Добавить(Разрешение);

	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = "Настроить и выполнить вручную";
	Команда.Идентификатор = "НастроитьИВыполнитьЗадачиВручную";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;

	Возврат ПараметрыРегистрации;

КонецФункции

Процедура ВыполнитьКоманду(ИмяКоманды, ПараметрыВыполнения) Экспорт

	Если ИмяКоманды = "СинхронизацияСигма" Тогда
		ВыполнитьСинхронизацию(ПараметрыВыполнения);
	КонецЕсли;

КонецПроцедуры

#Область Синхронизация

Процедура ВыполнитьСинхронизацию(ПараметрыВыполнения)

	// Очищаем ТЧ перед загрузкой
	Декларация.Очистить();
	КодыCMR.Очистить();
	ТранспортныеСредства.Очистить();
	НеНайденныеПункты.Очистить();

	// Режим 1: REST API Сигмы (приоритетный)
	Успех = ЗагрузитьЧерезAPISigma();

	// Режим 2: Файловый каталог (fallback)
	Если НЕ Успех Тогда
		ЗагрузитьИзФайловогоКаталога();
	КонецЕсли;

	// Создание документов из загруженных данных
	Если Декларация.Количество() > 0 Тогда
		СоздатьДокументыНаСервере();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область APIСигмы

// Загрузка операций через REST API edapi.sigma-soft.ru
// Endpoint 36: api/v1/report/getreportggi — полный отчёт по операциям
Функция ЗагрузитьЧерезAPISigma()

	АдресСервера = "edapi.sigma-soft.ru";
	// Доработка START {SS-3 2026-04-20}: credentials вынесены из кода в ХранилищеОбщихНастроек.
	// Код доступа и код участника загружаются из тех же настроек, что использует
	// APIСигма.epf (ключ "НастройкиВыгрузки" / владелец "Интерсофт").
	НастройкиСигмы = ЗагрузитьНастройкиСигмы();
	Если НастройкиСигмы = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НастройкиСигмы.КодДоступа) Тогда
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Настройки API Сигмы не заполнены. Откройте APIСигма.epf, введите Код доступа и participantcode.");
		Возврат Ложь;
	КонецЕсли;
	КодДоступа = НастройкиСигмы.КодДоступа;
	КодУчастника = НастройкиСигмы.КодУчастника;
	// Доработка END
	РазмерСтраницы = 200; // максимум API

	// Шаг 1: Авторизация (plain text код доступа)
	Токен = АвторизацияSigma(АдресСервера, КодДоступа);
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Не удалось авторизоваться в API Сигмы. Переключаюсь на файловый каталог.");
		Возврат Ложь;
	КонецЕсли;

	// Шаг 2: Получить последнюю дату синхронизации
	ДатаНачала = ПолучитьДатуПоследнейСинхронизации();
	ДатаОкончания = ТекущаяДатаСеанса();

	// Шаг 3: Постраничная загрузка getreportggi
	СчётчикОбработано = 0;
	НомерСтраницы = 1;
	КоличествоСтраниц = 0;

	Пока Истина Цикл
		ДанныеОперации = ПолучитьОтчётGGI(АдресСервера, Токен, ДатаНачала, ДатаОкончания, КодУчастника, НомерСтраницы);

		Если ДанныеОперации = Неопределено ИЛИ ДанныеОперации.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;

		КоличествоСтраниц = КоличествоСтраниц + 1;

		// Шаг 4: Обработка каждой операции на странице
		Для Каждого Операция Из ДанныеОперации Цикл
			Попытка
				ЗаполнитьИзAPIОперации(Операция, АдресСервера, Токен);
				СчётчикОбработано = СчётчикОбработано + 1;
			Исключение
				ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API.Операция",
					УровеньЖурналаРегистрации.Ошибка,,,
					"Ошибка обработки операции: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;

		// Если получили меньше максимума — это последняя страница
		Если ДанныеОперации.Количество() < РазмерСтраницы Тогда
			Прервать;
		КонецЕсли;

		НомерСтраницы = НомерСтраницы + 1;
	КонецЦикла;

	ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API",
		УровеньЖурналаРегистрации.Информация,,,
		"API Сигмы: загружено " + СчётчикОбработано + " операций за " + КоличествоСтраниц + " стр. за период "
		+ Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"));

	Возврат СчётчикОбработано > 0;

КонецФункции

// Доработка START {Авторизация: plain text код доступа вместо JSON login/password} {2026-04-02}
Функция АвторизацияSigma(АдресСервера, Знач КодДоступа, Знач НеИспользуется = "")

	Попытка
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение(АдресСервера, 443,,,,, ssl);

		Запрос = Новый HTTPЗапрос("/api/v1/auth/login");
		Запрос.УстановитьТелоИзСтроки(КодДоступа, КодировкаТекста.UTF8);
		Запрос.Заголовки.Вставить("Content-Type", "text/plain");

		Ответ = Соединение.ОтправитьДляОбработки(Запрос);

		Если Ответ.КодСостояния = 200 Тогда
			Токен = Ответ.ПолучитьТелоКакСтроку("UTF-8");
			Возврат СокрЛП(Токен);
		Иначе
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");
			ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API.Auth",
				УровеньЖурналаРегистрации.Предупреждение,,,
				"Ошибка авторизации (код " + Ответ.КодСостояния + "): " + ТелоОтвета);
			Возврат "";
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API.Auth",
			УровеньЖурналаРегистрации.Ошибка,,,
			"Исключение при авторизации: " + ОписаниеОшибки());
		Возврат "";
	КонецПопытки;

КонецФункции
// Доработка END

// Доработка START {participantcode в URL, числовые параметры, CSV-парсинг resData} {2026-04-02}
Функция ПолучитьОтчётGGI(АдресСервера, Токен, ДатаНачала, ДатаОкончания, КодУчастника = "", НомерСтраницы = 1)

	Попытка
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение(АдресСервера, 443,,,,, ssl);

		// participantcode — query-параметр URL (не body!)
		СтрокаURL = "/api/v1/report/getreportggi?participantcode=" + КодУчастника;

		// Параметры body — числовые значения без кавычек
		ТелоЗапроса = "{""datebegin"":""" + Формат(ДатаНачала, "ДФ=yyyy-MM-dd") + ""","
			+ """dateend"":""" + Формат(ДатаОкончания, "ДФ=yyyy-MM-dd") + ""","
			+ """withgoods"":1,"
			+ """pagenum"":" + Формат(НомерСтраницы, "ЧГ=") + ","
			+ """quantity"":200,"
			+ """fields"":""DUTYAMOUNT;CURRENCYCODE;GUARANTOR_SHORTNAME;GUARANTOR_INN;"
			+ "PROVIDER_SHORTNAME;PROVIDER_INN;DECLARANT_SHORTNAME;DECLARANT_INN;"
			+ "CARRIER_REGCODE;TSNUMBERS;TRANSPORTDOCUMENT_ID;GUARANTEEDOCUMENT_IDC;"
			+ "ARRIVALCUSTOMSCODE;ARRIVALCUSTOMSOFFICENAME;DEPATURECUSTOMSCODE;DEPATURECUSTOMSOFFICENAME;"
			+ "GCA_TARIFFAMOUNT;GCA_TARIFFDISTANCE;TRANSPORTMODECODE;"
			+ "TDOC_NAME;TDOC_NUMBER;TDOC_DATE;CDOC_NAME;CDOC_NUMBER;CDOC_DATE;"
			+ "TRANSITOPENDATE;GRN;MSS_ID;BDT_DATECRT;BDT_DATEMOD;BDT_COMMENTS;"
			+ "GOODSNUMERIC;GOODSTNVEDCODE;GOODSDESCRIPTION;GOODSQUANTITY;GROSSWEIGHTQUANTITY;"
			+ "INVOICEDCOST;SPEC_FIO""}";

		Запрос = Новый HTTPЗапрос(СтрокаURL);
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);
		Запрос.Заголовки.Вставить("Content-Type", "application/json");
		Запрос.Заголовки.Вставить("Accept", "application/json");
		Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);

		Ответ = Соединение.ОтправитьДляОбработки(Запрос);

		Если Ответ.КодСостояния <> 200 Тогда
			ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API.GGI",
				УровеньЖурналаРегистрации.Предупреждение,,,
				"Ошибка getreportggi (код " + Ответ.КодСостояния + "): "
				+ Ответ.ПолучитьТелоКакСтроку("UTF-8"));
			Возврат Неопределено;
		КонецЕсли;

		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");

		// Парсим JSON-обёртку
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		ОтветСтруктура = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();

		Если НЕ (ОтветСтруктура.Свойство("resCode") И ОтветСтруктура.resCode = 0) Тогда
			ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API.GGI",
				УровеньЖурналаРегистрации.Предупреждение,,,
				"API вернул ошибку: resCode=" + ОтветСтруктура.resCode
				+ ", resDescription=" + ОтветСтруктура.resDescription);
			Возврат Неопределено;
		КонецЕсли;

		// resData — CSV-строка с разделителем ";" и переводами строк \r\n
		// Первая строка — заголовки, остальные — данные
		Возврат РазобратьCSVОтвет(ОтветСтруктура.resData);

	Исключение
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.API.GGI",
			УровеньЖурналаРегистрации.Ошибка,,,
			"Исключение при запросе getreportggi: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Разбирает CSV-строку из resData в массив структур
// Формат: "заголовок1";"заголовок2"\r\n"значение1";"значение2"\r\n...
Функция РазобратьCSVОтвет(СтрокаCSV)

	Результат = Новый Массив;

	Если НЕ ЗначениеЗаполнено(СтрокаCSV) Тогда
		Возврат Результат;
	КонецЕсли;

	// Разбиваем по строкам (CSV использует \r\n)
	Строки = СтрРазделить(СтрокаCSV, Символы.ВК + Символы.ПС, Ложь);
	Если Строки.Количество() < 2 Тогда
		Возврат Результат;
	КонецЕсли;

	// Первая строка — заголовки
	Заголовки = РазобратьCSVСтроку(Строки[0]);

	// Остальные строки — данные
	Для Индекс = 1 По Строки.Количество() - 1 Цикл
		ТекСтрока = СокрЛП(Строки[Индекс]);
		Если НЕ ЗначениеЗаполнено(ТекСтрока) Тогда
			Продолжить;
		КонецЕсли;

		Значения = РазобратьCSVСтроку(ТекСтрока);
		Запись = Новый Структура;

		Для К = 0 По Заголовки.ВГраница() Цикл
			// Убираем скобки из заголовка: "Сумма обеспечения (DUTYAMOUNT)" → "DUTYAMOUNT"
			ИмяПоля = Заголовки[К];
			ПозОткр = СтрНайти(ИмяПоля, "(");
			ПозЗакр = СтрНайти(ИмяПоля, ")");
			Если ПозОткр > 0 И ПозЗакр > ПозОткр Тогда
				ИмяПоля = Сред(ИмяПоля, ПозОткр + 1, ПозЗакр - ПозОткр - 1);
			КонецЕсли;
			ИмяПоля = СокрЛП(ИмяПоля);

			Если К <= Значения.ВГраница() Тогда
				Запись.Вставить(ИмяПоля, Значения[К]);
			Иначе
				Запись.Вставить(ИмяПоля, "");
			КонецЕсли;
		КонецЦикла;

		Результат.Добавить(Запись);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Разбирает одну CSV-строку по разделителю ";", убирая кавычки
Функция РазобратьCSVСтроку(Строка)

	Результат = Новый Массив;
	Поля = СтрРазделить(Строка, ";");
	Для Каждого Поле Из Поля Цикл
		Значение = СокрЛП(Поле);
		// Убираем обрамляющие кавычки
		Если СтрДлина(Значение) >= 2
			И Лев(Значение, 1) = """"
			И Прав(Значение, 1) = """" Тогда
			Значение = Сред(Значение, 2, СтрДлина(Значение) - 2);
		КонецЕсли;
		Результат.Добавить(Значение);
	КонецЦикла;
	Возврат Результат;

КонецФункции
// Доработка END

// Заполняет строку ТЧ Декларация из данных API-операции
Процедура ЗаполнитьИзAPIОперации(Операция, АдресСервера, Токен)

	DocumentID = ?(Операция.Свойство("MSS_ID"), Операция.MSS_ID, "");

	// Дедупликация
	Если НЕ ЗначениеЗаполнено(DocumentID) Тогда
		Возврат;
	КонецЕсли;

	ОтборСтрок = Новый Структура("DocumentID", DocumentID);
	Если Декларация.НайтиСтроки(ОтборСтрок).Количество() > 0 Тогда
		Возврат;
	КонецЕсли;

	НоваяСтрокаТЧ = Декларация.Добавить();
	НоваяСтрокаТЧ.DocumentID = DocumentID;
	НоваяСтрокаТЧ.Файл = "API:" + DocumentID;

	// Номер ГТД (GRN = Global Reference Number)
	НоваяСтрокаТЧ.НомерГТД = ?(Операция.Свойство("GRN"), Операция.GRN, "");

	// Комментарий и парсинг email / флага #1#
	Комментарий = ?(Операция.Свойство("BDT_COMMENTS"), Операция.BDT_COMMENTS, "");
	НоваяСтрокаТЧ.Комментарий = Комментарий;
	Email = ИзвлечьEmailИзКомментария(Комментарий);
	НоваяСтрокаТЧ.ЧужоеОбеспечение = СтрНайти(Комментарий, "#1#") > 0;

	// Контрагент — алгоритм 4.1 по ТЗ
	ЗаказчикНаименование = ?(Операция.Свойство("PROVIDER_SHORTNAME"), Операция.PROVIDER_SHORTNAME, "");
	НоваяСтрокаТЧ.Контрагент = ИдентифицироватьЗаказчикаAPI(Email, ЗаказчикНаименование);

	// ИНН контрагента для подсказки
	НоваяСтрокаТЧ.ИННКонтрагента = ?(Операция.Свойство("PROVIDER_INN"), Операция.PROVIDER_INN, "");

	// Принципал
	ПринципалИмя = ?(Операция.Свойство("GUARANTOR_SHORTNAME"), Операция.GUARANTOR_SHORTNAME, "");
	Если ЗначениеЗаполнено(ПринципалИмя) Тогда
		НоваяСтрокаТЧ.Принципал = Справочники.Принципалы.НайтиПоНаименованию(ПринципалИмя);
	КонецЕсли;

	// Декларант
	ДекларантИмя = ?(Операция.Свойство("DECLARANT_SHORTNAME"), Операция.DECLARANT_SHORTNAME, "");
	Если ЗначениеЗаполнено(ДекларантИмя) Тогда
		НоваяСтрокаТЧ.Декларант = Справочники.Декларанты.НайтиПоНаименованию(ДекларантИмя);
	КонецЕсли;

	// Перевозчик
	ПеревозчикКод = ?(Операция.Свойство("CARRIER_REGCODE"), Операция.CARRIER_REGCODE, "");
	Если ЗначениеЗаполнено(ПеревозчикКод) Тогда
		НоваяСтрокаТЧ.Перевозчик = Справочники.Перевозчики.НайтиПоКоду(ПеревозчикКод);
		Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.Перевозчик) Тогда
			НоваяСтрокаТЧ.Перевозчик = Справочники.Перевозчики.НайтиПоНаименованию(ПеревозчикКод);
		КонецЕсли;
	КонецЕсли;

	// Пункт отправления
	КодОтправления = ?(Операция.Свойство("DEPATURECUSTOMSCODE"), Операция.DEPATURECUSTOMSCODE, "");
	НоваяСтрокаТЧ.КодТаможниОтправления = КодОтправления;
	Если ЗначениеЗаполнено(КодОтправления) Тогда
		НоваяСтрокаТЧ.ПунктОтправления = НайтиТаможенныйПункт(КодОтправления);
	КонецЕсли;

	// Пункт назначения
	КодНазначения = ?(Операция.Свойство("ARRIVALCUSTOMSCODE"), Операция.ARRIVALCUSTOMSCODE, "");
	Если ЗначениеЗаполнено(КодНазначения) Тогда
		НоваяСтрокаТЧ.ПунктНазначения = НайтиТаможенныйПункт(КодНазначения);
	КонецЕсли;

	// Обеспечение
	Попытка
		НоваяСтрокаТЧ.СуммаОбеспечения = Число(?(Операция.Свойство("DUTYAMOUNT"), Операция.DUTYAMOUNT, "0"));
		КодВалюты = ?(Операция.Свойство("CURRENCYCODE"), Операция.CURRENCYCODE, "RUB");
		НоваяСтрокаТЧ.ВалютаОбеспечения = Справочники.Валюты.НайтиПоНаименованию(КодВалюты);
	Исключение
	КонецПопытки;

	// Расстояние из тарифа
	Попытка
		НоваяСтрокаТЧ.Расстояние = Число(?(Операция.Свойство("GCA_TARIFFDISTANCE"), Операция.GCA_TARIFFDISTANCE, "0"));
	Исключение
	КонецПопытки;

	// Транспортный документ — CMR
	НомерCMR = ?(Операция.Свойство("TDOC_NUMBER"), Операция.TDOC_NUMBER, "");
	НоваяСтрокаТЧ.НомераCMR = НомерCMR;
	НоваяСтрокаТЧ.КоличествоCMR = ?(НомерCMR <> "", 1, 0);

	// Транспортные средства
	НомераТС = ?(Операция.Свойство("TSNUMBERS"), Операция.TSNUMBERS, "");
	Если ЗначениеЗаполнено(НомераТС) Тогда
		МассивНомеров = СтрРазделить(НомераТС, ",;/ ");
		Для Каждого НомерТС Из МассивНомеров Цикл
			Если ЗначениеЗаполнено(СокрЛП(НомерТС)) Тогда
				НоваяСтрокаТС = ТранспортныеСредства.Добавить();
				НоваяСтрокаТС.DocumentID = DocumentID;
				Транспорт = Справочники.ТранспортныеСредства.НайтиПоНаименованию(СокрЛП(НомерТС));
				НоваяСтрокаТС.ТранспортноеСредство = Транспорт;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Товары (если withgoods=1)
	Если Операция.Свойство("GOODSTNVEDCODE") Тогда
		НоваяСтрТов = КодыCMR.Добавить();
		НоваяСтрТов.DocumentID = DocumentID;
		НоваяСтрТов.КодТНВЭД = Операция.GOODSTNVEDCODE;
		НоваяСтрТов.Наименование = ?(Операция.Свойство("GOODSDESCRIPTION"), Операция.GOODSDESCRIPTION, "");
		Попытка
			НоваяСтрТов.Сумма = Число(?(Операция.Свойство("INVOICEDCOST"), Операция.INVOICEDCOST, "0"));
		Исключение
		КонецПопытки;
	КонецЕсли;

	// Дата оформления
	Попытка
		Если Операция.Свойство("TRANSITOPENDATE") И ЗначениеЗаполнено(Операция.TRANSITOPENDATE) Тогда
			НоваяСтрокаТЧ.ДатаОформления = XMLЗначение(Тип("Дата"), Операция.TRANSITOPENDATE);
		ИначеЕсли Операция.Свойство("BDT_DATECRT") И ЗначениеЗаполнено(Операция.BDT_DATECRT) Тогда
			НоваяСтрокаТЧ.ДатаОформления = XMLЗначение(Тип("Дата"), Операция.BDT_DATECRT);
		Иначе
			НоваяСтрокаТЧ.ДатаОформления = ТекущаяДатаСеанса();
		КонецЕсли;
	Исключение
		НоваяСтрокаТЧ.ДатаОформления = ТекущаяДатаСеанса();
	КонецПопытки;

	// Оператор (FIO)
	НоваяСтрокаТЧ.Оператор = ?(Операция.Свойство("SPEC_FIO"), Операция.SPEC_FIO, "");

КонецПроцедуры

// Идентификация заказчика из данных API
Функция ИдентифицироватьЗаказчикаAPI(Email, Наименование)

	Контрагент = Справочники.Контрагенты.ПустаяСсылка();

	// Шаг 1: По email через КонтактнаяИнформация
	Если ЗначениеЗаполнено(Email) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Объект КАК Контрагент
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &Email
		|	И КонтактнаяИнформация.Тип = &ТипEmail";
		Запрос.УстановитьПараметр("Email", "%" + Email + "%");
		Запрос.УстановитьПараметр("ТипEmail", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				Возврат Выборка.Контрагент;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// Шаг 2: По наименованию
	Если ЗначениеЗаполнено(Наименование) Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
	КонецЕсли;

	Возврат Контрагент;

КонецФункции

Функция ПолучитьДатуПоследнейСинхронизации()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МАКСИМУМ(ПрочитанныеДекларации.Период) КАК МаксДата
	|ИЗ
	|	РегистрСведений.ПрочитанныеДекларации КАК ПрочитанныеДекларации";

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.МаксДата) Тогда
			Возврат Выборка.МаксДата;
		КонецЕсли;
	КонецЕсли;

	// Если нет записей — за последние 6 месяцев
	Возврат ДобавитьМесяц(ТекущаяДатаСеанса(), -6);

КонецФункции

#КонецОбласти

#Область ФайловыйКаталог

// Fallback: загрузка из файлового каталога (старый режим)
Процедура ЗагрузитьИзФайловогоКаталога()

	// Пробуем Windows-путь, затем Linux-путь
	МассивПутей = Новый Массив;
	МассивПутей.Добавить("\\is-srv1c-02\share\ким\РусскийТранзит Дубликатор");
	МассивПутей.Добавить("/mnt/hdd2/share/ким/РусскийТранзит Дубликатор");

	ИмяКаталога = "";
	Для Каждого Путь Из МассивПутей Цикл
		Файл = Новый Файл(Путь);
		Если Файл.Существует() Тогда
			ИмяКаталога = Путь;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НЕ ЗначениеЗаполнено(ИмяКаталога) Тогда
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Файлы",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Файловый каталог Сигмы недоступен. Проверены пути: "
			+ МассивПутей[0] + ", " + МассивПутей[1]);
		Возврат;
	КонецЕсли;

	МассивФайлов = НайтиФайлы(ИмяКаталога, "*.xml", Истина);

	Если МассивФайлов.Количество() = 0 Тогда
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Файлы",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"XML-файлы не найдены в каталоге: " + ИмяКаталога);
		Возврат;
	КонецЕсли;

	СчётчикОбработано = 0;
	СчётчикПропущено = 0;

	Для Каждого ЭлементФайл Из МассивФайлов Цикл
		Попытка
			Результат = ЗаполнитьИзXML(ЭлементФайл.ПолноеИмя);
			Если Результат = "Пропущен" Тогда
				СчётчикПропущено = СчётчикПропущено + 1;
			Иначе
				СчётчикОбработано = СчётчикОбработано + 1;
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Файлы",
				УровеньЖурналаРегистрации.Ошибка,,,
				"Ошибка обработки файла: " + ЭлементФайл.ПолноеИмя + " | " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

	ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Файлы",
		УровеньЖурналаРегистрации.Информация,,,
		"Файлы: обработано " + СчётчикОбработано + ", пропущено " + СчётчикПропущено);

КонецПроцедуры

#КонецОбласти

#Область ПарсингXML

// Заполняет ТЧ из XML-файла Сигмы
Функция ЗаполнитьИзXML(ФайлОбработки) Экспорт

	// Проверка на дубль файла
	Если ПроверитьФайл(ФайлОбработки) Тогда
		Возврат "Пропущен";
	КонецЕсли;

	НовыйФайл = Новый ЧтениеТекста(ФайлОбработки, КодировкаТекста.UTF8);
	СтрокаXML = НовыйФайл.Прочитать();
	НовыйФайл.Закрыть();

	// Удаляем префиксы пространств имён
	СтрокаXML = СтрЗаменить(СтрокаXML, "cat_ru:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "tci:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "/tci:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "/cat_ru:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "app:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "/app:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "RUScat_ru:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "catESAD_cu:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "RUDECLcat:", "");

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);

	Считанное = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	СериализованныйДокумент = ОбъектXDTOВСтруктуру(Считанное);

	Если НЕ СериализованныйДокумент.Body.Signature.Object.Свойство("TransitInfo") Тогда
		Возврат "Пропущен";
	КонецЕсли;

	TransitInfo = СериализованныйДокумент.Body.Signature.Object.TransitInfo;
	Header = TransitInfo.Header;
	Consigment = TransitInfo.Consigment;
	DocumentID = TransitInfo.DocumentID;

	// Дедупликация по DocumentID в ТЧ обработки
	ОтборСтрок = Новый Структура("DocumentID", DocumentID);
	НайденныеСтроки = Декларация.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат "Пропущен";
	КонецЕсли;

	НоваяСтрокаТЧ = Декларация.Добавить();
	НоваяСтрокаТЧ.DocumentID = DocumentID;
	НоваяСтрокаТЧ.Файл = ФайлОбработки;

	// Номер ГТД
	TDNumber = Header.TDNumber;
	НоваяСтрокаТЧ.НомерГТД = TDNumber.CustomsCode + "/"
		+ СтрЗаменить(TDNumber.RegistrationDate, "-", "") + "/"
		+ TDNumber.GTDNumber;

	// Статус транзита
	ЗаполнитьСтатусТранзита(НоваяСтрокаТЧ, TransitInfo.StatusName);

	// Комментарий — содержит email в решётках и возможно флаг #1#
	Комментарий = ?(TransitInfo.Свойство("Comment"), TransitInfo.Comment, "");
	НоваяСтрокаТЧ.Комментарий = Комментарий;

	// Парсинг email из решёток: #client@email.com#
	Email = ИзвлечьEmailИзКомментария(Комментарий);

	// Проверка флага «чужое обеспечение» #1#
	ЧужоеОбеспечение = СтрНайти(Комментарий, "#1#") > 0;
	НоваяСтрокаТЧ.ЧужоеОбеспечение = ЧужоеОбеспечение;

	// Перевозчик — прямой поиск по наименованию
	НоваяСтрокаТЧ.Перевозчик = НайтиИлиСоздатьПеревозчика(Header);

	// Декларант — поиск по наименованию из XML
	НоваяСтрокаТЧ.Декларант = НайтиДекларанта(TransitInfo);

	// Контрагент (Заказчик) — алгоритм 4.1 по ТЗ:
	// 1) Парсим email из Comment
	// 2) Ищем в КонтактнаяИнформация
	// 3) Если не нашли — ищем по наименованию OrganizationName
	НоваяСтрокаТЧ.Контрагент = ИдентифицироватьЗаказчика(Email, Consigment);

	// Принципал — поиск по наименованию
	НоваяСтрокаТЧ.Принципал = НайтиПринципала(Consigment);

	// ИНН/КПП контрагента из XML (для подсказки при ручном сопоставлении)
	Попытка
		Если Consigment.Consignee.Свойство("INNID") Тогда
			НоваяСтрокаТЧ.ИННКонтрагента = Consigment.Consignee.INNID;
		КонецЕсли;
		Если Consigment.Consignee.Свойство("KPPID") Тогда
			НоваяСтрокаТЧ.КППКонтрагента = Consigment.Consignee.KPPID;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// Пункты отправления и назначения
	ЗаполнитьПункты(НоваяСтрокаТЧ, Header, TransitInfo);

	// Транспортные средства
	ЗаполнитьТранспортныеСредства(TransitInfo);

	// Товарные позиции и коды CMR
	ЗаполнитьТовары(НоваяСтрокаТЧ, DocumentID, Consigment);

	// CMR-документы
	ЗаполнитьCMR(НоваяСтрокаТЧ, Consigment);

	// Обеспечение (гарантия)
	ЗаполнитьОбеспечение(НоваяСтрокаТЧ, TransitInfo);

	// Дата оформления
	НоваяСтрокаТЧ.ДатаОформления = ?(TransitInfo.Свойство("TransitStampDateTime"),
		XMLЗначение(Тип("Дата"), TransitInfo.TransitStampDateTime),
		ТекущаяДатаСеанса());

	Возврат "Обработан";

КонецФункции

#КонецОбласти

#Область ИдентификацияКонтрагентов

// Алгоритм 4.1 по ТЗ: Идентификация Заказчика по E-mail
Функция ИдентифицироватьЗаказчика(Email, Consigment)

	Контрагент = Справочники.Контрагенты.ПустаяСсылка();

	// Шаг 1: Поиск по email в стандартном регистре КонтактнаяИнформация (БСП)
	Если ЗначениеЗаполнено(Email) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Объект КАК Контрагент
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &Email
		|	И КонтактнаяИнформация.Тип = &ТипEmail";
		Запрос.УстановитьПараметр("Email", "%" + Email + "%");
		Запрос.УстановитьПараметр("ТипEmail", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				Контрагент = Выборка.Контрагент;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// Шаг 2: Если не нашли по email — пробуем по наименованию
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Попытка
			Если Consigment.Consignee.Свойство("OrganizationName") Тогда
				Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(
					Consigment.Consignee.OrganizationName);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	Возврат Контрагент;

КонецФункции

// Извлекает email из текста Comment, обрамлённый решётками #email@domain.com#
Функция ИзвлечьEmailИзКомментария(Комментарий)

	Email = "";
	ПозицияСобаки = СтрНайти(Комментарий, "@");
	Если ПозицияСобаки = 0 Тогда
		Возврат Email;
	КонецЕсли;

	// Ищем email в решётках: #...@...#
	ПозНачала = 0;
	ПозКонца = 0;
	Для Индекс = 1 По СтрДлина(Комментарий) Цикл
		Символ = Сред(Комментарий, Индекс, 1);
		Если Символ = "#" Тогда
			Если ПозНачала = 0 Тогда
				ПозНачала = Индекс;
			Иначе
				ПозКонца = Индекс;
				// Проверяем что между решётками есть @
				Фрагмент = Сред(Комментарий, ПозНачала + 1, ПозКонца - ПозНачала - 1);
				Если СтрНайти(Фрагмент, "@") > 0 И НЕ Фрагмент = "1" Тогда
					Email = СокрЛП(Фрагмент);
					Возврат Email;
				КонецЕсли;
				ПозНачала = 0;
				ПозКонца = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Email;

КонецФункции

Функция НайтиИлиСоздатьПеревозчика(Header)

	Перевозчик = Справочники.Перевозчики.ПустаяСсылка();
	Если НЕ Header.Carrier.Свойство("OrganizationName") Тогда
		Возврат Перевозчик;
	КонецЕсли;

	ИмяПеревозчика = Header.Carrier.OrganizationName;
	Перевозчик = Справочники.Перевозчики.НайтиПоНаименованию(ИмяПеревозчика);

	Если НЕ ЗначениеЗаполнено(Перевозчик) Тогда
		НовыйПеревозчик = Справочники.Перевозчики.СоздатьЭлемент();
		НовыйПеревозчик.Наименование = ИмяПеревозчика;
		Попытка
			НовыйПеревозчик.Записать();
			Перевозчик = НовыйПеревозчик.Ссылка;
		Исключение
			ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Перевозчик",
				УровеньЖурналаРегистрации.Предупреждение,,,
				"Не удалось создать перевозчика: " + ИмяПеревозчика + " | " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

	Возврат Перевозчик;

КонецФункции

Функция НайтиДекларанта(TransitInfo)

	Декларант = Справочники.Декларанты.ПустаяСсылка();
	Попытка
		Если TransitInfo.Свойство("DeclarantDetails")
			И TransitInfo.DeclarantDetails.Свойство("OrganizationName") Тогда

			ИмяДекларанта = TransitInfo.DeclarantDetails.OrganizationName;
			Декларант = Справочники.Декларанты.НайтиПоНаименованию(ИмяДекларанта);

			Если НЕ ЗначениеЗаполнено(Декларант) Тогда
				НовыйДекларант = Справочники.Декларанты.СоздатьЭлемент();
				НовыйДекларант.Наименование = ИмяДекларанта;
				НовыйДекларант.Записать();
				Декларант = НовыйДекларант.Ссылка;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Декларант",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Ошибка поиска декларанта: " + ОписаниеОшибки());
	КонецПопытки;

	Возврат Декларант;

КонецФункции

Функция НайтиПринципала(Consigment)

	Принципал = Справочники.Принципалы.ПустаяСсылка();
	Попытка
		Если Consigment.Consignor.Свойство("OrganizationName") Тогда
			ИмяПринципала = Consigment.Consignor.OrganizationName;
			Принципал = Справочники.Принципалы.НайтиПоНаименованию(ИмяПринципала);

			Если НЕ ЗначениеЗаполнено(Принципал) Тогда
				НовыйПринципал = Справочники.Принципалы.СоздатьЭлемент();
				НовыйПринципал.Наименование = ИмяПринципала;
				НовыйПринципал.Записать();
				Принципал = НовыйПринципал.Ссылка;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Принципал",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Ошибка поиска принципала: " + ОписаниеОшибки());
	КонецПопытки;

	Возврат Принципал;

КонецФункции

#КонецОбласти

#Область Пункты

Процедура ЗаполнитьПункты(НоваяСтрокаТЧ, Header, TransitInfo)

	// Страна начала транзита
	НоваяСтрокаТЧ.СтранаНачалаТранзита = Header.DepartureCountryCode;

	// Пункт отправления
	КодТаможниОтправления = ?(TransitInfo.Свойство("CustomsCode"), TransitInfo.CustomsCode, "");
	НоваяСтрокаТЧ.КодТаможниОтправления = КодТаможниОтправления;

	Если ЗначениеЗаполнено(КодТаможниОтправления) Тогда
		НоваяСтрокаТЧ.ПунктОтправления = НайтиТаможенныйПункт(КодТаможниОтправления);
	КонецЕсли;

	// Если пункт не найден по коду таможни — ищем по стране
	Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.ПунктОтправления)
		И НЕ Header.DepartureCountryCode = "RU" Тогда
		СтранаОтправления = Справочники.СтранаОформления.НайтиПоКоду(Header.DepartureCountryCode);
		Если ЗначениеЗаполнено(СтранаОтправления) Тогда
			НоваяСтрокаТЧ.ПунктОтправления = СтранаОтправления.ТаможенныйПунктПоУмолчанию;
		КонецЕсли;
	КонецЕсли;

	// Пункт назначения
	Попытка
		Если TransitInfo.Свойство("DestinationPlace") Тогда
			КодПунктаНазначения = "";
			Если TransitInfo.DestinationPlace.Свойство("Code") Тогда
				КодПунктаНазначения = TransitInfo.DestinationPlace.Code;
			КонецЕсли;

			Если ЗначениеЗаполнено(КодПунктаНазначения) Тогда
				НоваяСтрокаТЧ.ПунктНазначения = НайтиТаможенныйПункт(КодПунктаНазначения);
			КонецЕсли;

			// Если не нашли по коду — ищем по наименованию
			Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.ПунктНазначения)
				И TransitInfo.DestinationPlace.Свойство("OfficeName") Тогда
				НоваяСтрокаТЧ.ПунктНазначения = Справочники.ТаможенныеПункты.НайтиПоНаименованию(
					TransitInfo.DestinationPlace.OfficeName);
			КонецЕсли;

			// Если не нашли — пробуем создать через customs.gov.ru
			Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.ПунктНазначения) Тогда
				Если ЗначениеЗаполнено(КодПунктаНазначения) Тогда
					НоваяСтрокаТЧ.ПунктНазначения = СоздатьТаможенныйПунктПоКоду(КодПунктаНазначения);
				КонецЕсли;
			КонецЕсли;

			// Записываем ненайденные пункты
			Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.ПунктНазначения) Тогда
				НоваяСтрокаПунктов = НеНайденныеПункты.Добавить();
				НоваяСтрокаПунктов.ПунктНазначения = ?(TransitInfo.DestinationPlace.Свойство("OfficeName"),
					TransitInfo.DestinationPlace.OfficeName, "");
				НоваяСтрокаПунктов.Код = КодПунктаНазначения;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Пункты",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Ошибка заполнения пунктов: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// Ищет таможенный пункт по коду — сначала в справочнике, затем создаёт через customs.gov.ru
Функция НайтиТаможенныйПункт(Код)

	Если НЕ ЗначениеЗаполнено(Код) Тогда
		Возврат Справочники.ТаможенныеПункты.ПустаяСсылка();
	КонецЕсли;

	Пункт = Справочники.ТаможенныеПункты.НайтиПоКоду(Код);
	Возврат Пункт;

КонецФункции

// Создаёт таможенный пункт через парсинг customs.gov.ru
// Защита от дублей: перед созданием повторно проверяем справочник
Функция СоздатьТаможенныйПунктПоКоду(Код)

	Если НЕ ЗначениеЗаполнено(Код) ИЛИ Код = "RU" Тогда
		Возврат Справочники.ТаможенныеПункты.ПустаяСсылка();
	КонецЕсли;

	// Повторная проверка перед HTTP-запросом (защита от дублей)
	Пункт = Справочники.ТаможенныеПункты.НайтиПоКоду(Код);
	Если ЗначениеЗаполнено(Пункт) Тогда
		Возврат Пункт;
	КонецЕсли;

	Попытка
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		URL = "registers/customs-apparatus?code=" + Код + "&name=&city=";
		Сервис = Новый HTTPСоединение("customs.gov.ru",,,,,, ssl);

		Запрос = Новый HTTPЗапрос(URL);
		Результат = Сервис.Получить(Запрос);
		Сервис = Неопределено;

		Если Результат.КодСостояния <> 200 Тогда
			Возврат Справочники.ТаможенныеПункты.ПустаяСсылка();
		КонецЕсли;

		Страница = Результат.ПолучитьТелоКакСтроку("UTF-8");
		Див = "<div class=" + Символ(34) + "info-card__title" + Символ(34) + ">";
		ДивИтем = СтрЗаменить(Див, "info-card__title", "info-card__item-info");

		Наименование = СокрЛП(ПоискБлока(Страница, Див));
		КодПункта = СокрЛП(ПоискБлока(Страница, ДивИтем, "Код таможенноо органа"));

		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			Возврат Справочники.ТаможенныеПункты.ПустаяСсылка();
		КонецЕсли;

		// Финальная проверка: может уже создан другим потоком
		ПунктФинальный = Справочники.ТаможенныеПункты.НайтиПоКоду(?(ЗначениеЗаполнено(КодПункта), КодПункта, Код));
		Если ЗначениеЗаполнено(ПунктФинальный) Тогда
			Возврат ПунктФинальный;
		КонецЕсли;

		НовыйТП = Справочники.ТаможенныеПункты.СоздатьЭлемент();
		НовыйТП.Наименование = Наименование;
		НовыйТП.Код = ?(ЗначениеЗаполнено(КодПункта), КодПункта, Код);
		НовыйТП.КодПункта = НовыйТП.Код;
		НовыйТП.Город = СокрЛП(ПоискБлока(Страница, ДивИтем, "Город"));
		НовыйТП.Адрес = СокрЛП(ПоискБлока(Страница, ДивИтем, "Адрес таможенного органа"));
		НовыйТП.Индекс = СокрЛП(ПоискБлока(Страница, ДивИтем, "Почтовый индекс"));

		НовыйТП.Записать();
		Возврат НовыйТП.Ссылка;
	Исключение
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.СозданиеПункта",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Не удалось создать таможенный пункт (код: " + Код + "): " + ОписаниеОшибки());
		Возврат Справочники.ТаможенныеПункты.ПустаяСсылка();
	КонецПопытки;

КонецФункции

Функция ПоискБлока(ДанныеПоиска, Блок, ВоспомогательнаяСтрока = "")
	Если ВоспомогательнаяСтрока = "" Тогда
		ПозицияНачала = СтрНайти(ДанныеПоиска, Блок);
	Иначе
		ПозицияНачала = СтрНайти(ДанныеПоиска, Блок,, СтрНайти(ДанныеПоиска, ВоспомогательнаяСтрока));
	КонецЕсли;
	Если ПозицияНачала = 0 Тогда
		Возврат "";
	КонецЕсли;
	ПозицияКонца = СтрНайти(ДанныеПоиска, "</div>",, ПозицияНачала);
	Если ПозицияКонца = 0 Тогда
		Возврат "";
	КонецЕсли;
	Наименование = Сред(ДанныеПоиска, ПозицияНачала, ПозицияКонца - ПозицияНачала);
	Наименование = СокрЛП(СтрЗаменить(Наименование, Блок, ""));
	Возврат Наименование;
КонецФункции

#КонецОбласти

#Область ТранспортИТовары

Процедура ЗаполнитьТранспортныеСредства(TransitInfo)

	Если НЕ TransitInfo.Header.Transport.Свойство("TransportMeans") Тогда
		Возврат;
	КонецЕсли;

	МассивТС = TransitInfo.Header.Transport.TransportMeans;
	Если ТипЗнч(МассивТС) <> Тип("Массив") Тогда
		ВременныйМассив = Новый Массив;
		ВременныйМассив.Добавить(МассивТС);
		МассивТС = ВременныйМассив;
	КонецЕсли;

	Для Каждого ТС Из МассивТС Цикл
		ТипТС = ?(ТС.Свойство("TransportKindCode"), ТС.TransportKindCode, "");
		Регион = ?(ТС.Свойство("TransportMeansNationalityCode"), ТС.TransportMeansNationalityCode, "");
		НомерТС = ?(ТС.Свойство("TransportIdentifier"),
			СтрЗаменить(ТС.TransportIdentifier + Регион, " ", ""), "");

		Транспорт = Справочники.ТранспортныеСредства.НайтиПоНаименованию(НомерТС);
		Если НЕ ЗначениеЗаполнено(Транспорт) Тогда
			НовоеТС = Справочники.ТранспортныеСредства.СоздатьЭлемент();
			НовоеТС.Наименование = НомерТС;
			НовоеТС.Код = НомерТС;
			НовоеТС.Тип = Справочники.ТипыТранспортныхСредств.НайтиПоКоду(Лев(ТипТС, 2));
			Попытка
				НовоеТС.Записать();
				Транспорт = НовоеТС.Ссылка;
			Исключение
				ЗаписьЖурналаРегистрации("ЧтениеДеклараций.ТС",
					УровеньЖурналаРегистрации.Предупреждение,,,
					"Не удалось создать ТС: " + НомерТС + " | " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;

		НоваяСтрокаТС = ТранспортныеСредства.Добавить();
		НоваяСтрокаТС.ТранспортноеСредство = Транспорт;
		НоваяСтрокаТС.DocumentID = TransitInfo.DocumentID;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТовары(НоваяСтрокаТЧ, DocumentID, Consigment)

	Товары = Consigment.GoodsItem;
	Если ТипЗнч(Товары) <> Тип("Массив") Тогда
		ВременныйМассив = Новый Массив;
		ВременныйМассив.Добавить(Consigment.GoodsItem);
		Товары = ВременныйМассив;
	КонецЕсли;

	СуммаДокумента = 0;
	ПоследняяВалюта = Справочники.Валюты.ПустаяСсылка();

	Для Каждого Товар Из Товары Цикл
		НоваяСтрТов = КодыCMR.Добавить();
		НоваяСтрТов.DocumentID = DocumentID;
		НоваяСтрТов.КодТНВЭД = Товар.TNVEDCode;

		Если ТипЗнч(Товар.GoodsDescription) = Тип("Массив") Тогда
			Для Каждого Позиция Из Товар.GoodsDescription Цикл
				НоваяСтрТов.Наименование = НоваяСтрТов.Наименование + "/" + Позиция;
			КонецЦикла;
		Иначе
			НоваяСтрТов.Наименование = Товар.GoodsDescription;
		КонецЕсли;

		Попытка
			НоваяСтрТов.Сумма = Число(Товар.InvoicedCost);
		Исключение
			НоваяСтрТов.Сумма = 0;
		КонецПопытки;

		НоваяСтрТов.Валюта = ?(Товар.Свойство("InvoicedCurrencyCode"),
			Справочники.Валюты.НайтиПоНаименованию(Товар.InvoicedCurrencyCode),
			?(Товар.Свойство("CurrencyCode"),
				Справочники.Валюты.НайтиПоНаименованию(Товар.CurrencyCode),
				Справочники.Валюты.ПустаяСсылка()));

		СуммаДокумента = СуммаДокумента + НоваяСтрТов.Сумма;
		ПоследняяВалюта = НоваяСтрТов.Валюта;
	КонецЦикла;

	НоваяСтрокаТЧ.СуммаДокумента = СуммаДокумента;
	НоваяСтрокаТЧ.ВалютаДокумента = ПоследняяВалюта;

КонецПроцедуры

Процедура ЗаполнитьCMR(НоваяСтрокаТЧ, Consigment)

	Если НЕ Consigment.Свойство("ProducedDocument") Тогда
		Возврат;
	КонецЕсли;

	ДокументыФайла = Consigment.ProducedDocument;
	Если ТипЗнч(ДокументыФайла) <> Тип("Массив") Тогда
		ВременныйМассив = Новый Массив;
		ВременныйМассив.Добавить(Consigment.ProducedDocument);
		ДокументыФайла = ВременныйМассив;
	КонецЕсли;

	CMR = "";
	Для Каждого Док Из ДокументыФайла Цикл
		Если Док.DocumentKind = "02015" Тогда
			CMR = Док.PrDocumentNumber;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	НоваяСтрокаТЧ.НомераCMR = CMR;
	НоваяСтрокаТЧ.КоличествоCMR = ?(CMR <> "", 1, 0);

КонецПроцедуры

Процедура ЗаполнитьОбеспечение(НоваяСтрокаТЧ, TransitInfo)

	Если НЕ TransitInfo.Свойство("Guarantee") Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Гарантия = TransitInfo.Guarantee;
		НоваяСтрокаТЧ.СуммаОбеспечения = Число(
			Гарантия.TransitGuaranteeDocDetails.GuaranteeAmount.RUSAmount);
		НоваяСтрокаТЧ.ВалютаОбеспечения = Справочники.Валюты.НайтиПоНаименованию(
			Гарантия.TransitGuaranteeDocDetails.GuaranteeAmount.RUSCurrencyCode);
	Исключение
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Обеспечение",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Ошибка чтения обеспечения: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура ЗаполнитьСтатусТранзита(НоваяСтрокаТЧ, СтатусИмя)

	Если СтатусИмя = "TR_ALLOWED" Тогда
		НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.ТранзитРазрешен;
	ИначеЕсли СтатусИмя = "TR_REVOKED" Тогда
		НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.Аннулирован;
	ИначеЕсли СтатусИмя = "TR_COMPLETED_W_RESERVATION" Тогда
		НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.ВыполненИЗарезервирован;
	ИначеЕсли СтатусИмя = "TR_COMPLETED" Тогда
		НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.Выполнен;
	ИначеЕсли СтатусИмя = "TD_REVOKED" Тогда
		НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.Отменено;
	ИначеЕсли СтатусИмя = "TR_ISSUE_DENIED" Тогда
		НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.Отказано;
	ИначеЕсли СтатусИмя = "TR_TERMINATED" Тогда
		НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.ПрекращеноДосрочно;
	Иначе
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Статус",
			УровеньЖурналаРегистрации.Предупреждение,,,
			"Неизвестный статус транзита: " + СтатусИмя);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументов

Процедура СоздатьДокументыНаСервере()

	Для Каждого Строка Из Декларация Цикл

		РезультатЗаполнения = Новый Структура("Ошибка, Статус, СчитанныйФайл, Документ");

		// Проверка существования документа по DocumentID + НомерГТД
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Документ.ОперацияПоПоручительству КАК Д
		|ГДЕ
		|	Д.ВнешнийИдентификатор = &DocumentID
		|	И Д.НомерГТД = &НомерГТД";
		Запрос.УстановитьПараметр("НомерГТД", Строка.НомерГТД);
		Запрос.УстановитьПараметр("DocumentID", Строка.DocumentID);

		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			НовыйДокумент = РезультатЗапроса.Выгрузить()[0].Ссылка.ПолучитьОбъект();
		Иначе
			НовыйДокумент = Документы.ОперацияПоПоручительству.СоздатьДокумент();
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(НовыйДокумент, Строка);
		НовыйДокумент.ВнешнийИдентификатор = Строка.DocumentID;
		НовыйДокумент.Дата = Строка.ДатаОформления;
		НовыйДокумент.Бабулево = Истина;

		// Алгоритм 6.0: Чужое обеспечение
		Если Строка.ЧужоеОбеспечение Тогда
			НовыйДокумент.ОплатыУслуг.Очистить();
			НовыйДокумент.ДополнительныеУслуги.Очистить();
			НовыйДокумент.Оплата = 0;
			НовыйДокумент.СтатусОперации = Перечисления.СтатусыОпераций.Обработан;
		Иначе
			НовыйДокумент.СтатусОперации = Перечисления.СтатусыОпераций.ВРаботе;
		КонецЕсли;

		// Заполнение ТЧ КодыCMR по DocumentID
		НовыйДокумент.КодыCMR.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ *
		|ПОМЕСТИТЬ ВТ_Таблица
		|ИЗ &Таблица КАК Таблица
		|ГДЕ Таблица.DocumentID = &DocumentID
		|;
		|ВЫБРАТЬ * ИЗ ВТ_Таблица";
		Запрос.УстановитьПараметр("Таблица", КодыCMR.Выгрузить());
		Запрос.УстановитьПараметр("DocumentID", Строка.DocumentID);

		Попытка
			Результат = Запрос.Выполнить().Выбрать();
			Пока Результат.Следующий() Цикл
				ЦМР = НовыйДокумент.КодыCMR.Добавить();
				ЦМР.НомерCMR = Строка.НомераCMR;
				ЦМР.Валюта = Результат.Валюта;
				ЦМР.КоличествоКодов = Результат.КоличествоКодов;
				ЦМР.Цена = ?(Результат.КоличествоКодов = 0, 0, Результат.Сумма / Результат.КоличествоКодов);
			КонецЦикла;
		Исключение
			ЗаписьЖурналаРегистрации("ЧтениеДеклараций.КодыCMR",
				УровеньЖурналаРегистрации.Предупреждение,,,
				"Ошибка заполнения КодыCMR для " + Строка.DocumentID + ": " + ОписаниеОшибки());
		КонецПопытки;

		// Заполнение ТС
		Запрос.УстановитьПараметр("Таблица", ТранспортныеСредства.Выгрузить());
		Попытка
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() > 0 Тогда
				НовыйДокумент.ОсновноеТС = Результат[0].ТранспортноеСредство;
				Если Результат.Количество() > 1 Тогда
					НовыйДокумент.ДополнительноеТС = Результат[1].ТранспортноеСредство;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;

		// Запись документа
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Ошибка = СформироватьТекстОшибок(НовыйДокумент);
			РезультатЗаполнения.Ошибка = Ошибка;
		Исключение
			Попытка
				НовыйДокумент.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("ЧтениеДеклараций.ЗаписьДокумента",
					УровеньЖурналаРегистрации.Ошибка,,,
					"Не удалось записать документ " + Строка.НомерГТД + ": " + ОписаниеОшибки());
			КонецПопытки;
			РезультатЗаполнения.Ошибка = "Ошибка записи: " + ОписаниеОшибки();
		КонецПопытки;

		РезультатЗаполнения.СчитанныйФайл = Строка.Файл;
		РезультатЗаполнения.Документ = НовыйДокумент.Ссылка;
		ЗаписатьРезультатЧтения(РезультатЗаполнения);

	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьРезультатЧтения(РезультатЗаполнения)

	НаборЗаписей = РегистрыСведений.ПрочитанныеДекларации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(РезультатЗаполнения.Документ);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(НаборЗаписей[0], РезультатЗаполнения);
	Иначе
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, РезультатЗаполнения);
	КонецЕсли;

	НаборЗаписей.Записать();

КонецПроцедуры

Функция СформироватьТекстОшибок(Док)

	ТекстОшибки = "Не удалось записать по причине: ";
	ЕстьОшибки = Ложь;

	Если НЕ ЗначениеЗаполнено(Док.Перевозчик) Тогда
		ТекстОшибки = ТекстОшибки + "не заполнен перевозчик, ";
		ЕстьОшибки = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Док.Контрагент) Тогда
		ТекстОшибки = ТекстОшибки + "не заполнен контрагент, ";
		ЕстьОшибки = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Док.ПунктОтправления) Тогда
		ТекстОшибки = ТекстОшибки + "не заполнен пункт отправления, ";
		ЕстьОшибки = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Док.ПунктНазначения) Тогда
		ТекстОшибки = ТекстОшибки + "не заполнен пункт назначения, ";
		ЕстьОшибки = Истина;
	КонецЕсли;

	Если Док.СуммаОбеспечения = 0 Тогда
		ТекстОшибки = ТекстОшибки + "не заполнена сумма обеспечения, ";
		ЕстьОшибки = Истина;
	КонецЕсли;

	Если ЕстьОшибки Тогда
		Возврат Лев(ТекстОшибки, СтрДлина(ТекстОшибки) - 2) + ".";
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область Вспомогательное

Функция ПроверитьФайл(Файл)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Файл
	|ИЗ
	|	РегистрСведений.ПрочитанныеДекларации
	|ГДЕ
	|	Файл = &Файл";
	Запрос.УстановитьПараметр("Файл", Файл);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Функция ОбъектXDTOВСтруктуру(ОбъектXDTO, ПараметрыПреобразования = Неопределено) Экспорт

	Структура = Новый Структура;
	ТипОбъектаXDTO = ОбъектXDTO.Тип();

	Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл

		ИмяСвойства = Свойство.Имя;
		ЗначениеСвойства = ОбъектXDTO[ИмяСвойства];

		Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
			Структура.Вставить(ИмяСвойства, ОбъектXDTOВСтруктуру(ЗначениеСвойства, ПараметрыПреобразования));

		ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("СписокXDTO") Тогда
			Структура.Вставить(ИмяСвойства, Новый Массив);
			Для Индекс = 0 По ЗначениеСвойства.Количество() - 1 Цикл
				ЭлементСписка = ЗначениеСвойства.Получить(Индекс);
				Если ТипЗнч(ЭлементСписка) = Тип("ОбъектXDTO") Тогда
					Структура[ИмяСвойства].Добавить(ОбъектXDTOВСтруктуру(ЭлементСписка, ПараметрыПреобразования));
				Иначе
					Структура[ИмяСвойства].Добавить(ЭлементСписка);
				КонецЕсли;
			КонецЦикла;

		Иначе
			Структура.Вставить(ИмяСвойства, ЗначениеСвойства);

			Если ПараметрыПреобразования <> Неопределено
				И ПараметрыПреобразования.НайтиИдентификаторы
				И Свойство.Тип = ПараметрыПреобразования.ТипUUID Тогда
				РезультатПоиска = ПараметрыПреобразования.ТипыИдентификаторов[ТипОбъектаXDTO];
				Если РезультатПоиска <> Неопределено
					И РезультатПоиска.ИмяПоля = ИмяСвойства Тогда
					ПараметрыПреобразования.Идентификаторы[РезультатПоиска.ИмяТаблицы].Вставить(
						ЗначениеСвойства, РезультатПоиска.ПустоеЗначение);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат Структура;

КонецФункции

#КонецОбласти

// Доработка START {SS-3 2026-04-20}: единая точка чтения credentials API Сигмы
// из ХранилищеОбщихНастроек. Используется общий ключ "НастройкиВыгрузки" с владельцем
// "Интерсофт" — тот же, что пишет APIСигма.epf (СохранитьНастройкиНаСервере).
// Структура: КодДоступа (строка), КодУчастника (строка).
Функция ЗагрузитьНастройкиСигмы()
	Попытка
		СтруктураНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиВыгрузки", , , , "Интерсофт");
	Исключение
		ЗаписьЖурналаРегистрации("ЧтениеДеклараций.Credentials",
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

	Если СтруктураНастроек = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура("КодДоступа, КодУчастника", "", "");
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Если СтруктураНастроек.Свойство("КодДоступа") Тогда
			Результат.КодДоступа = СтруктураНастроек.КодДоступа;
		КонецЕсли;
		Если СтруктураНастроек.Свойство("КодУчастника") Тогда
			Результат.КодУчастника = СтруктураНастроек.КодУчастника;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Результат.КодДоступа) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Результат;
КонецФункции
// Доработка END

// Доработка END
